TestingAndTraining/src/Catalogs/НаборыВопросов/НаборыВопросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыВопросов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.Вопросы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TestingAndTraining/src/Catalogs/Вопросы/Вопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вопросы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Иллюстрация</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьИллюстрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingAndTraining/src/Catalogs/НаборыВопросов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыВопросы

&НаКлиенте
Процедура ВопросыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для Каждого Строка Из ВыбранноеЗначение Цикл
		//@skip-check query-in-loop
		ДобавитьВыбранныеЗначения(Строка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВопросы(Команда)
	Объект.Вопросы.Очистить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборВопросов(Команда)
	Если Не ЗначениеЗаполнено(Объект.Тест) Тогда
		ПоказатьПредупреждение( , "Заполните поле ""Тест"" перед подбором");
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("ЗакрыватьприВыборе, МножественныйВыбор, РежимВыбора", Ложь, Истина, Истина);
	ОткрытьФорму("Справочник.Вопросы.ФормаВыбора", ПараметрыФормы, Элементы.Вопросы, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьВыбранныеЗначения(ВыбранноеЗначение)
	Если ВыбранноеЗначение.ЭтоГруппа Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Вопросы.Ссылка,
		|	Вопросы.ЭтоГруппа
		|ИЗ
		|	Справочник.Вопросы КАК Вопросы
		|ГДЕ
		|	Вопросы.Родитель = &Родитель";

		Запрос.УстановитьПараметр("Родитель", ВыбранноеЗначение);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ЭтоГруппа Тогда
				//@skip-check query-in-loop
				ДобавитьВыбранныеЗначения(ВыборкаДетальныеЗаписи.Ссылка);
			Иначе
				ДобавитьНовыйЭлемент(ВыборкаДетальныеЗаписи.Ссылка);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ДобавитьНовыйЭлемент(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыйЭлемент(ВыбранноеЗначение)
	НайденныеСтроки = Объект.Вопросы.НайтиСтроки(Новый Структура("Вопрос", ВыбранноеЗначение));
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = Объект.Вопросы.Добавить();
		НоваяСтрока.Вопрос = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
